DataProcessors/РабочийСтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтол</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДоработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИзменение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РКД_отдельно_от_композиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласованДизайнером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомплектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоДоработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРекламация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РабочийСтол/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекущийИнтерфейс, мЗамерыИнтерфейс;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мЗамерыИнтерфейс = Новый Массив(6);
	мЗамерыИнтерфейс[0] = ПредопределенноеЗначение("Справочник.Интерфейсы.Замер1");
	мЗамерыИнтерфейс[1] = ПредопределенноеЗначение("Справочник.Интерфейсы.Замер2");
	мЗамерыИнтерфейс[2] = ПредопределенноеЗначение("Справочник.Интерфейсы.Дизайнер");
	мЗамерыИнтерфейс[3] = ПредопределенноеЗначение("Справочник.Интерфейсы.ВедущийКонструктор");
	мЗамерыИнтерфейс[4] = ПредопределенноеЗначение("Справочник.Интерфейсы.Конструктор");
	мЗамерыИнтерфейс[5] = ПредопределенноеЗначение("Справочник.Интерфейсы.Менеджер");
	
	КоличествоЭлементов = Элементы.Интерфейсы.СписокВыбора.Количество();
	
	Если КоличествоЭлементов = 0 Тогда
		
		Отказ = Истина;
		Возврат;
		
	Иначе
		
		ТекущийИнтерфейс 	= Элементы.Интерфейсы.СписокВыбора[0].Значение;
		Интерфейсы 			= ТекущийИнтерфейс; 
		
		Если КоличествоЭлементов = 1 Тогда
			
			Элементы.Интерфейсы.Видимость = Ложь;	
			
		КонецЕсли;
		
		ЗаполнитьТипыЗадач();
		
		ОбновитьПредставление(ТекущийИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсполнительЗамеры 	= омСотрудники.ПолучитьТекущегоПользователя();
	ИсполнительПКД 		= ИсполнительЗамеры;
	НеВыполненныеЗамеры = Истина;
	
	
	Если РольДоступна("АдминистраторСистемы") Тогда
		
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Замер2, 				"Замеры");	
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Замер1, 				"Замеры1");	
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Дизайнер, 				"Дизайнер");	
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.ВедущийКонструктор, 	"Ведущий конструктор");	
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Конструктор, 			"Конструктор");	
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Менеджер, 				"Менеджер");	
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.ФинансовыйДиректор, 	"Финансовый директор");	
		
	ИначеЕсли РольДоступна("РуководительЗамера") Тогда
		
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Замер1, "Замеры1");	
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Замер2, "Замеры");	
		
	ИначеЕсли РольДоступна("Замерщик") Тогда

		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Замер2, "Замеры");	
		
	ИначеЕсли РольДоступна("Дизайнер") ИЛИ РольДоступна("Менеджер") Тогда

		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Дизайнер, 				"Дизайнер");	
		Если РольДоступна("Дизайнер") Тогда
			Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Дизайнер, 			"Дизайнер");	
		КонецЕсли;
		Если РольДоступна("Менеджер") Тогда
			Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Менеджер, 			"Менеджер");	
		КонецЕсли;

	ИначеЕсли РольДоступна("ГлавныйКонструктор") Тогда
		
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.ВедущийКонструктор, 	"Ведущий конструктор");	
		
	ИначеЕсли РольДоступна("Конструктор") Тогда
		
		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Конструктор, 			"Конструктор");
		Элементы.Исполнитель.ТолькоПросмотр = Истина;
		Элементы.МоиЗадачи.Видимость		= Ложь;

	ИначеЕсли РольДоступна("ФинансовыйДиректор") Тогда

		Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.ФинансовыйДиректор,	"Финансовый директор");	

	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИнтерфейсыПриИзменении(Элемент)
	Если ПустаяСтрока(Интерфейсы) Тогда
		
	 	Интерфейсы = ТекущийИнтерфейс;
		
	ИначеЕсли НЕ Интерфейсы = ТекущийИнтерфейс Тогда 	
		
		ТекущийИнтерфейс = Интерфейсы;
		ОбновитьПредставление(ТекущийИнтерфейс);
		
	КонецЕсли;
КонецПроцедуры 

Процедура ОбновитьПредставление(ТекущийИнтерфейс)
	
	КомплектыКонструктора.Очистить();
	ЗадачиВРаботеВедущийКонструктор.Очистить();
	
	
	Если ТекущийИнтерфейс = Справочники.Интерфейсы.Замер2 Тогда
		
		Элементы.ГруппаЗамеры.Видимость 			= Истина;
		Элементы.ГруппаКонструктор.Видимость 		= Ложь;
		Элементы.ГруппаЗамер1.Видимость 			= Ложь;
		Элементы.ГруппаДизайнер.Видимость 			= Ложь;
	    Элементы.ГруппаВедущийКонструктор.Видимость = Ложь;
	    Элементы.ТипыЗадач.Видимость 				= Истина;
	    Элементы.ГруппаФильтры.Видимость 			= Истина;
	    Элементы.ГруппаМенеджеры.Видимость 			= Ложь;
	    Элементы.ГруппаФиндиректор.Видимость 		= Ложь;

		ВывестиПредставлениеЗамеры(ТекущийИнтерфейс);
		
	ИначеЕсли ТекущийИнтерфейс = Справочники.Интерфейсы.Замер1 Тогда
		
		Элементы.ГруппаЗамеры.Видимость 			= Истина;
	    Элементы.ГруппаКонструктор.Видимость 		= Ложь;
		Элементы.ГруппаЗамер1.Видимость 			= Истина;
	    Элементы.ГруппаДизайнер.Видимость 			= Ложь;
	    Элементы.ГруппаВедущийКонструктор.Видимость = Ложь;
	    Элементы.ТипыЗадач.Видимость 				= Истина;
	    Элементы.ГруппаФильтры.Видимость 			= Истина;
	    Элементы.ГруппаМенеджеры.Видимость 			= Ложь;
	    Элементы.ГруппаФиндиректор.Видимость 		= Ложь;

		ВывестиПредставлениеЗамеры(ТекущийИнтерфейс);
		
	ИначеЕсли ТекущийИнтерфейс = Справочники.Интерфейсы.Дизайнер Тогда      
		
		Элементы.ГруппаЗамеры.Видимость 			= Ложь;
	    Элементы.ГруппаЗамер1.Видимость 			= Ложь;
	    Элементы.ГруппаКонструктор.Видимость 		= Ложь;
	    Элементы.ГруппаДизайнер.Видимость 			= Истина;
	    Элементы.ГруппаВедущийКонструктор.Видимость = Ложь;
	    Элементы.ГруппаФильтры.Видимость 			= Ложь;
	    Элементы.ТипыЗадач.Видимость 				= Ложь;
	    Элементы.ГруппаМенеджеры.Видимость 			= Ложь;
	    Элементы.ГруппаФиндиректор.Видимость 		= Ложь;
		
		мТипыЗадачКонструирования = Новый Массив;
		мТипыЗадачКонструирования.Добавить(Перечисления.ТипыЗадачКонструирования.КонтрольДизайнера);
		
		ПодтверждениеПКД.Параметры.УстановитьЗначениеПараметра("ТипыЗадачКонструирования", 		мТипыЗадачКонструирования);
		ПодтверждениеПКД.Параметры.УстановитьЗначениеПараметра("Проект", 						Проект);
		ПодтверждениеПКД.Параметры.УстановитьЗначениеПараметра("Исполнитель", 					ИсполнительЗамеры);
		
		ВывестиПредставлениеДизайнер(ТекущийИнтерфейс);
		
	ИначеЕсли ТекущийИнтерфейс = Справочники.Интерфейсы.ВедущийКонструктор Тогда       
		
	    Элементы.ГруппаДизайнер.Видимость 			= Ложь;
		Элементы.ГруппаЗамеры.Видимость 			= Ложь;
		Элементы.ГруппаКонструктор.Видимость 		= Ложь;
		Элементы.ГруппаВедущийКонструктор.Видимость = Истина;
		Элементы.ГруппаФильтры.Видимость 			= Ложь;
		Элементы.ТипыЗадач.Видимость 				= Ложь;
	    Элементы.ГруппаМенеджеры.Видимость 			= Ложь;
	    Элементы.ГруппаФиндиректор.Видимость 		= Ложь;
		
		мТипыЗадачКонструирования = Новый Массив;
		мТипыЗадачКонструирования.Добавить(Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором);
		
		ПодтверждениеПКД.Параметры.УстановитьЗначениеПараметра("ТипыЗадачКонструирования", 		мТипыЗадачКонструирования);
		ПодтверждениеПКД.Параметры.УстановитьЗначениеПараметра("Проект", 						Проект);
		ПодтверждениеПКД.Параметры.УстановитьЗначениеПараметра("Исполнитель", 					ИсполнительЗамеры);
		
		КонтрольТЗ.Параметры.УстановитьЗначениеПараметра("Исполнитель", 		ИсполнительЗамеры);
		КонтрольТЗ.Параметры.УстановитьЗначениеПараметра("Проект", 				Проект);
		
		Если ЗначениеЗаполнено(ИсполнительЗамеры) Тогда
		
			Элементы.ЗадачиВРаботеВедущийКонструктор.Видимость = Истина;
			ЗаполнитьЗадачиВРаботеВедущийКонструктор();	
		
		Иначе
			
			Элементы.ЗадачиВРаботеВедущийКонструктор.Видимость = Ложь;
		
		КонецЕсли;

		ВывестиПредставлениеЗамеры(ТекущийИнтерфейс);
		
	ИначеЕсли ТекущийИнтерфейс = Справочники.Интерфейсы.Конструктор Тогда         

		Элементы.ГруппаДизайнер.Видимость 			= Ложь;
		Элементы.ГруппаЗамеры.Видимость 			= Ложь;
	    Элементы.ГруппаКонструктор.Видимость 		= Истина;
	    Элементы.ГруппаВедущийКонструктор.Видимость = Ложь;
	    Элементы.ГруппаФильтры.Видимость 			= Ложь;
	    Элементы.ТипыЗадач.Видимость 				= Ложь;
	    Элементы.ГруппаМенеджеры.Видимость 			= Ложь;
	    Элементы.ГруппаФиндиректор.Видимость 		= Ложь;
		
		Если ЗначениеЗаполнено(ИсполнительЗамеры) Тогда
		
			Элементы.КомплектыКонструктора.Видимость = Истина;
			ЗаполнитьКомплектыКонструктора();	
		
		Иначе
			
			Элементы.КомплектыКонструктора.Видимость = Ложь;
		
		КонецЕсли;
		ЗаполнитьЗадачи_РКД_ПКД();
		
	ИначеЕсли ТекущийИнтерфейс = Справочники.Интерфейсы.ФинансовыйДиректор Тогда

		Элементы.ГруппаДизайнер.Видимость 			= Ложь;
		Элементы.ГруппаЗамеры.Видимость 			= Ложь;
	    Элементы.ГруппаВедущийКонструктор.Видимость = Ложь;
		Элементы.ГруппаКонструктор.Видимость 		= Ложь;
	    Элементы.ГруппаФильтры.Видимость 			= Ложь;
	    Элементы.ТипыЗадач.Видимость 				= Ложь;
	    Элементы.ГруппаМенеджеры.Видимость 			= Ложь;
	    Элементы.ГруппаФиндиректор.Видимость 		= Истина;
		
		ЗадачиФиндиректора.Параметры.УстановитьЗначениеПараметра("Исполнитель", 		ИсполнительЗамеры);
		ЗадачиФиндиректора.Параметры.УстановитьЗначениеПараметра("Проект", 				Проект);
		
	ИначеЕсли ТекущийИнтерфейс = Справочники.Интерфейсы.Менеджер Тогда

		Элементы.ГруппаДизайнер.Видимость 			= Ложь;
		Элементы.ГруппаЗамеры.Видимость 			= Ложь;
	    Элементы.ГруппаВедущийКонструктор.Видимость = Ложь;
		Элементы.ГруппаКонструктор.Видимость 		= Ложь;
	    Элементы.ГруппаФильтры.Видимость 			= Ложь;
	    Элементы.ТипыЗадач.Видимость 				= Ложь;
	    Элементы.ГруппаМенеджеры.Видимость 			= Истина;
	    Элементы.ГруппаФиндиректор.Видимость 		= Ложь;
		
		ЗадачиМенеджера.Параметры.УстановитьЗначениеПараметра("Исполнитель", 			ИсполнительЗамеры);
		ЗадачиМенеджера.Параметры.УстановитьЗначениеПараметра("Проект", 				Проект);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьЗадачиВРаботеВедущийКонструктор()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ втПользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ВедущийКонструктор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ,
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	ДатыКомплекта.КрайПКД КАК Край
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО Задачи_ПКД.ОбъектТЗ = ДатыКомплекта.Комплект
		|ГДЕ
		|	НЕ Задачи_ПКД.Выполнена
		|	И Задачи_ПКД.ТипЗадачи В(&ТипыЗадачКонструктора)
		|	И НЕ Задачи_ПКД.ОбобщеннаяЗадача
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_ПКД.Проект = &Проект
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задача_РКД.ИзделиеКомплект,
		|	Задача_РКД.Ссылка,
		|	ДатыКомплекта.КрайРКД
		|ИЗ
		|	Задача.Задача_РКД КАК Задача_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО Задача_РКД.ИзделиеКомплект = ДатыКомплекта.Комплект
		|ГДЕ
		|	НЕ Задача_РКД.Выполнена
		|	И Задача_РКД.ТипЗадачи В(&ТипыЗадачКонструктора)
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задача_РКД.Проект = &Проект
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ОбъектТЗ КАК ОбъектТЗ,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	вт.Задача КАК Задача,
		|	вт.Край КАК Край
		|ПОМЕСТИТЬ втОбъекты
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, ) КАК ДанныеКомплектаСрезПоследних
		|		ПО вт.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбъекты.ТекущаяСтадия КАК ТекущаяСтадия,
		|	втОбъекты.Задача КАК Задача,
		|	втОбъекты.Конструктор КАК Конструктор,
		|	втОбъекты.Край КАК Край
		|ИЗ
		|	втПользователь КАК втПользователь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОбъекты КАК втОбъекты
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзменениеСотрудника.СрезПоследних КАК ИзменениеСотрудникаСрезПоследних
		|			ПО втОбъекты.ОбъектТЗ = ИзменениеСотрудникаСрезПоследних.ОбъектИзменения
		|		ПО (втПользователь.Сотрудник = ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор, втОбъекты.ОбъектТЗ.Проект.ВедущийКонструктор))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Край";
	
	Запрос.УстановитьПараметр("ВедущийКонструктор", 	ИсполнительЗамеры);
	Запрос.УстановитьПараметр("Проект", 				Проект);
	Запрос.УстановитьПараметр("ТипыЗадачКонструктора", 	омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	
	ЗадачиВРаботеВедущийКонструктор.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


Процедура ЗаполнитьКомплектыКонструктора()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ втПользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Конструктор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	НЕ Задачи_ПКД.Выполнена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задача_РКД.ИзделиеКомплект
		|ИЗ
		|	Задача.Задача_РКД КАК Задача_РКД
		|ГДЕ
		|	НЕ Задача_РКД.Выполнена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ОбъектТЗ КАК ОбъектТЗ,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ПОМЕСТИТЬ втОбъекты
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних(, ) КАК ДанныеКомплектаСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПользователь КАК втПользователь
		|			ПО втПользователь.Сотрудник = ДанныеКомплектаСрезПоследних.Конструктор
		|		ПО вт.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.ОбъектТЗ,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбъекты.ОбъектТЗ КАК Комплект,
		|	втОбъекты.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор, втОбъекты.ОбъектТЗ.Проект.ВедущийКонструктор) КАК ВедущийКонструктор,
		|	ЕСТЬNULL(ИзменениеСотрудникаСрезПоследних.Дизайнер, втОбъекты.ОбъектТЗ.Проект.Дизайнер) КАК Дизайнер
		|ИЗ
		|	втОбъекты КАК втОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзменениеСотрудника.СрезПоследних КАК ИзменениеСотрудникаСрезПоследних
		|		ПО втОбъекты.ОбъектТЗ = ИзменениеСотрудникаСрезПоследних.ОбъектИзменения";
	
	Запрос.УстановитьПараметр("Конструктор", ИсполнительЗамеры);
	
	КомплектыКонструктора.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


Процедура ЗаполнитьЗадачи_РКД_ПКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Задача,
		|	Задачи_ПКД.Проект КАК Проект,
		|	Задачи_ПКД.Исполнитель КАК Исполнитель,
		|	ДатыКомплекта.КрайПКД КАК Край,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО Задачи_ПКД.ОбъектТЗ = ДатыКомплекта.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ Задачи_ПКД.Выполнена
		|	И Задачи_ПКД.ТипЗадачи В(&ТипЗадачи)
		|	И ВЫБОР
		|			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_ПКД.Исполнитель = &Исполнитель
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задачи_ПКД.Проект = &Проект
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задача_РКД.Ссылка,
		|	Задача_РКД.Проект,
		|	Задача_РКД.Исполнитель,
		|	ДатыКомплекта.КрайРКД,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия
		|ИЗ
		|	Задача.Задача_РКД КАК Задача_РКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО Задача_РКД.ИзделиеКомплект = ДатыКомплекта.Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО Задача_РКД.ИзделиеКомплект = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	НЕ Задача_РКД.Выполнена
		|	И ВЫБОР
		|			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задача_РКД.Исполнитель = &Исполнитель
		|		КОНЕЦ
		|	И Задача_РКД.ТипЗадачи В(&ТипЗадачи)
		|	И ВЫБОР
		|			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Задача_РКД.Проект = &Проект
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Задача КАК Задача,
		|	вт.Проект КАК Проект,
		|	вт.Исполнитель КАК Исполнитель,
		|	вт.Край КАК Край,
		|	вт.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	вт КАК вт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Край,
		|	вт.Задача.Наименование";
	
	Запрос.УстановитьПараметр("ТипЗадачи", 		омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("Исполнитель", 	ИсполнительЗамеры);
	Запрос.УстановитьПараметр("Проект", 		Проект);
	
	
	Задачи_ПКД_РКД.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


Процедура ВывестиПредставлениеДизайнер(ТекущийИнтерфейс)

    тзЗадачиДизайнера.Очистить();
	
	мТипыЗадач = Новый Массив(2);
	мТипыЗадач[0] = Перечисления.ОбъектыЗадач.ДополнитьКартуПроектаДиз;
	мТипыЗадач[1] = Перечисления.ОбъектыЗадач.СоздатьКартуПроектаДиз;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПодготовкаПроекта.Ссылка КАК Задача,
	               |	ПодготовкаПроекта.ТипЗадачи КАК ТипЗадачи,
	               |	ПодготовкаПроекта.Проект КАК Проект,
	               |	ПодготовкаПроекта.Исполнитель КАК Исполнитель,
	               |	ПодготовкаПроекта.КрайняяДатаИсполнения КАК КрайняяДата,
	               |	ПодготовкаПроекта.Комментарий КАК Комментарий,
	               |	ПодготовкаПроекта.Наименование КАК ПредставлениеЗадача,
	               |	ПодготовкаПроекта.Выполнена КАК Выполнена,
	               |	ВЫБОР
	               |		КОГДА ПодготовкаПроекта.ТипЗадачи = ЗНАЧЕНИЕ(Перечисление.ОбъектыЗадач.ДополнитьКартуПроектаДиз)
	               |			ТОГДА ""ДополнитьКартуПроектаДиз""
	               |		ИНАЧЕ ""СоздатьКартуПроектаДиз""
	               |	КОНЕЦ КАК Тип
	               |ИЗ
	               |	Задача.ПодготовкаПроекта КАК ПодготовкаПроекта
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &НеВыполнена
	               |				ТОГДА НЕ ПодготовкаПроекта.Выполнена
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПодготовкаПроекта.Проект = &Проект
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПодготовкаПроекта.Исполнитель = &Исполнитель
	               |		КОНЕЦ
	               |	И ПодготовкаПроекта.ТипЗадачи В(&ТипиЗадач)";
	
	Запрос.УстановитьПараметр("НеВыполнена", 	НеВыполненныеЗамеры);
	Запрос.УстановитьПараметр("Исполнитель", 	ИсполнительЗамеры);
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("ТипиЗадач", 		мТипыЗадач);
	
	Если Сортировка = 1 Тогда
	
		Запрос.Текст = Запрос.Текст + "       
		|УПОРЯДОЧИТЬ ПО           
		|	ПодготовкаПроекта.Наименование,
		|	ПодготовкаПроекта.КрайняяДатаИсполнения";

	Иначе
	
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО           
		|	ПодготовкаПроекта.КрайняяДатаИсполнения,
		|	ПодготовкаПроекта.Наименование";

	КонецЕсли;
	
	стКоличествоЗадач = Новый Структура();
	стКоличествоЗадач.Вставить("ДополнитьКартуПроектаДиз", 	0);
	стКоличествоЗадач.Вставить("СоздатьКартуПроектаДиз", 	0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мТипДляОтображения = Новый Массив;
	
	Для каждого х Из ТипыЗадач Цикл
	
		Если х.Пометка Тогда
		
			мТипДляОтображения.Добавить(х.Значение);	
		
		КонецЕсли;
	
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ мТипДляОтображения.Найти(Выборка.Тип) = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(тзЗадачиДизайнера.Добавить(), Выборка);
		КонецЕсли;
		
		стКоличествоЗадач[Выборка.Тип] = стКоличествоЗадач[Выборка.Тип] + 1;
	
	КонецЦикла;
	
	ЗаполнитьТипыЗадач(стКоличествоЗадач);
	
	Если тзЗадачиОсобые.Количество() = 0 Тогда
		Элементы.тзЗадачиОсобые.Видимость = Ложь;
	Иначе	
		Элементы.тзЗадачиОсобые.Видимость = Истина;
		тзЗадачиОсобые.Сортировать("Статус Убыв");
	КонецЕсли;
	
	Если Элементы.ГруппаЗамер1.Видимость Тогда
	
		ЗаполнитьГрафикВыездов();
	
	КонецЕсли;
	

КонецПроцедуры

Процедура ВывестиПредставлениеЗамеры(ТекущийИнтерфейс)

    тзЗадачи.Очистить();
    Выезды.Очистить();
	тзЗадачиОсобые.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПроверитьГабаритныеЧертежи.Ссылка КАК Ссылка,
	               |	ПроверитьГабаритныеЧертежи.Выполнена КАК Выполнена,
	               |	ПроверитьГабаритныеЧертежи.Исполнитель КАК Исполнитель,
	               |	ПроверитьГабаритныеЧертежи.Проект КАК Проект,
	               |	ПроверитьГабаритныеЧертежи.КрайняяДатаИсполнения КАК КрайняяДата,
	               |	ПроверитьГабаритныеЧертежи.Комментарий КАК Комментарий,
	               |	ПроверитьГабаритныеЧертежи.Наименование КАК Наименование,
	               |	""ПроверитьГабаритныеЧертежи"" КАК Тип
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &НеВыполнена
	               |				ТОГДА НЕ ПроверитьГабаритныеЧертежи.Выполнена
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПроверитьГабаритныеЧертежи.Проект = &Проект
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПроверитьГабаритныеЧертежи.Исполнитель = &Исполнитель
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НетДанныхДляИзмененияСтатусаГЧ.Ссылка,
	               |	НетДанныхДляИзмененияСтатусаГЧ.Выполнена,
	               |	НетДанныхДляИзмененияСтатусаГЧ.Исполнитель,
	               |	НетДанныхДляИзмененияСтатусаГЧ.Проект,
	               |	НетДанныхДляИзмененияСтатусаГЧ.КрайняяДатаИсполнения,
	               |	НетДанныхДляИзмененияСтатусаГЧ.Комментарий,
	               |	НетДанныхДляИзмененияСтатусаГЧ.Наименование,
	               |	""НетДанныхДляИзмененияСтатусаГЧ""
	               |ИЗ
	               |	Задача.НетДанныхДляИзмененияСтатусаГЧ КАК НетДанныхДляИзмененияСтатусаГЧ
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НетДанныхДляИзмененияСтатусаГЧ.Проект = &Проект
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НетДанныхДляИзмененияСтатусаГЧ.Исполнитель = &Исполнитель
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &НеВыполнена
	               |				ТОГДА НЕ НетДанныхДляИзмененияСтатусаГЧ.Выполнена
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СоздатьМодельГабаритногоЧертежа.Ссылка,
	               |	СоздатьМодельГабаритногоЧертежа.Выполнена,
	               |	СоздатьМодельГабаритногоЧертежа.Исполнитель,
	               |	СоздатьМодельГабаритногоЧертежа.Проект,
	               |	СоздатьМодельГабаритногоЧертежа.КрайняяДатаИсполнения,
	               |	СоздатьМодельГабаритногоЧертежа.Комментарий,
	               |	СоздатьМодельГабаритногоЧертежа.Наименование,
	               |	""СоздатьМодельГабаритногоЧертежа""
	               |ИЗ
	               |	Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ СоздатьМодельГабаритногоЧертежа.Проект = &Проект
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ СоздатьМодельГабаритногоЧертежа.Исполнитель = &Исполнитель
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &НеВыполнена
	               |				ТОГДА НЕ СоздатьМодельГабаритногоЧертежа.Выполнена
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ИзменениеСтатусаГЧ.Ссылка,
	               |	ИзменениеСтатусаГЧ.Выполнена,
	               |	ИзменениеСтатусаГЧ.Исполнитель,
	               |	ИзменениеСтатусаГЧ.Проект,
	               |	ИзменениеСтатусаГЧ.КрайняяДатаИсполнения,
	               |	ИзменениеСтатусаГЧ.Комментарий,
	               |	ИзменениеСтатусаГЧ.Наименование,
	               |	""ИзменениеСтатусаГЧ""
	               |ИЗ
	               |	Задача.ИзменениеСтатусаГЧ КАК ИзменениеСтатусаГЧ
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ИзменениеСтатусаГЧ.Проект = &Проект
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ИзменениеСтатусаГЧ.Исполнитель = &Исполнитель
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &НеВыполнена
	               |				ТОГДА НЕ ИзменениеСтатусаГЧ.Выполнена
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт.Ссылка КАК Задача,
	               |	вт.Ссылка.Наименование КАК ПредставлениеЗадача,
	               |	вт.Выполнена КАК Выполнена,
	               |	вт.Исполнитель КАК Исполнитель,
	               |	вт.Проект КАК Проект,
	               |	вт.КрайняяДата КАК КрайняяДата,
	               |	вт.Комментарий КАК Комментарий,
	               |	ВЫБОР
	               |		КОГДА вт.КрайняяДата < &ТД
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Оформление,
	               |	ЕСТЬNULL(СтатусыЗадач.Статус, 0) КАК Статус,
	               |	вт.Тип КАК Тип
	               |ИЗ
	               |	вт КАК вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗадач КАК СтатусыЗадач
	               |		ПО вт.Ссылка = СтатусыЗадач.Задача
	               |			И (&ТекущийИнтерфейс = СтатусыЗадач.Интерфейс)";
	
	Запрос.УстановитьПараметр("ТекущийИнтерфейс", 	ТекущийИнтерфейс);
	Запрос.УстановитьПараметр("НеВыполнена", 		НеВыполненныеЗамеры);
	Запрос.УстановитьПараметр("Исполнитель", 		ИсполнительЗамеры);
	Запрос.УстановитьПараметр("Проект", 			Проект);
	Запрос.УстановитьПараметр("ТД", 				ТекущаяДата());
	
	Если Сортировка = 1 Тогда
	
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО           
		|	вт.Наименование,
		|	вт.КрайняяДата";

	Иначе
	
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО           
		|	вт.КрайняяДата,
		|	вт.Наименование";

	КонецЕсли;
	
	стКоличествоЗадач = Новый Структура();
	стКоличествоЗадач.Вставить("ПроверитьГабаритныеЧертежи", 		0);
	стКоличествоЗадач.Вставить("НетДанныхДляИзмененияСтатусаГЧ", 	0);
	стКоличествоЗадач.Вставить("СоздатьМодельГабаритногоЧертежа", 	0);
	стКоличествоЗадач.Вставить("ИзменениеСтатусаГЧ", 				0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мТипДляОтображения = Новый Массив;
	
	Для каждого х Из ТипыЗадач Цикл
	
		Если х.Пометка Тогда
		
			мТипДляОтображения.Добавить(х.Значение);	
		
		КонецЕсли;
	
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ мТипДляОтображения.Найти(Выборка.Тип) = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(тзЗадачи.Добавить(), Выборка);
		КонецЕсли;
		
		Если Выборка.Статус > 0 Тогда
			ЗаполнитьЗначенияСвойств(тзЗадачиОсобые.Добавить(), Выборка);
		КонецЕсли;

		стКоличествоЗадач[Выборка.Тип] = стКоличествоЗадач[Выборка.Тип] + 1;
	
	КонецЦикла;
	
	ЗаполнитьТипыЗадач(стКоличествоЗадач);
	
	Если тзЗадачиОсобые.Количество() = 0 Тогда
		Элементы.тзЗадачиОсобые.Видимость = Ложь;
	Иначе	
		Элементы.тзЗадачиОсобые.Видимость = Истина;
		тзЗадачиОсобые.Сортировать("Статус Убыв");
	КонецЕсли;
	
	Если Элементы.ГруппаЗамер1.Видимость Тогда
	
		ЗаполнитьГрафикВыездов();
	
	КонецЕсли;
	

КонецПроцедуры

Процедура ЗаполнитьТипыЗадач(стКоличествоЗадач = Неопределено)
	
	мУстановленыеМетки = Новый Массив;
	Для каждого х Из ТипыЗадач Цикл
	
		Если х.Пометка Тогда
		
			мУстановленыеМетки.Добавить(х.Значение);	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	ТипыЗадач.Очистить();
	
	Если Интерфейсы = Справочники.Интерфейсы.Замер1 ИЛИ Интерфейсы = Справочники.Интерфейсы.Замер2 Тогда
		
		Если стКоличествоЗадач = Неопределено Тогда
			
			ДобавитьЭлементВТипыЗадач("СоздатьМодельГабаритногоЧертежа", 	"Создать модель габаритного чертежа", 	Истина);
			ДобавитьЭлементВТипыЗадач("ПроверитьГабаритныеЧертежи", 		"Проверить габаритные чертежи",			Истина);
			ДобавитьЭлементВТипыЗадач("НетДанныхДляИзмененияСтатусаГЧ", 	"Нет данных для изменения статуса ГЧ",	Истина);
			ДобавитьЭлементВТипыЗадач("ИзменениеСтатусаГЧ", 				"Изменение статуса ГЧ",					Истина);
			
			Если РольДоступна("Замерщик") Тогда
				
				Элементы.Интерфейсы.СписокВыбора.Добавить(Справочники.Интерфейсы.Замер2, "Замеры");	
				
				Для каждого х Из ТипыЗадач Цикл
					
					Если х.Значение = "НетДанныхДляИзмененияСтатусаГЧ" ИЛИ х.Значение = "ИзменениеСтатусаГЧ" Тогда
						
						х.Пометка = Ложь;	
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			Количество = стКоличествоЗадач.СоздатьМодельГабаритногоЧертежа;
			Метка = НЕ мУстановленыеМетки.Найти("СоздатьМодельГабаритногоЧертежа") = Неопределено;
			ДобавитьЭлементВТипыЗадач("СоздатьМодельГабаритногоЧертежа", 	?(Количество = 0, "Создать модель габаритного чертежа", "Создать модель габаритного чертежа (" + Количество + ")"), Метка);
			
			Количество = стКоличествоЗадач.ПроверитьГабаритныеЧертежи;	
			Метка = НЕ мУстановленыеМетки.Найти("ПроверитьГабаритныеЧертежи") = Неопределено;
			ДобавитьЭлементВТипыЗадач("ПроверитьГабаритныеЧертежи", 	?(Количество = 0, "Проверить габаритные чертежи", "Проверить габаритные чертежи (" + Количество + ")"), Метка);
			
			Количество = стКоличествоЗадач.НетДанныхДляИзмененияСтатусаГЧ;	
			Метка = НЕ мУстановленыеМетки.Найти("НетДанныхДляИзмененияСтатусаГЧ") = Неопределено;
			ДобавитьЭлементВТипыЗадач("НетДанныхДляИзмененияСтатусаГЧ", 	?(Количество = 0, "Нет данных для изменения статуса ГЧ", "Нет данных для изменения статуса ГЧ (" + Количество + ")"), Метка);
			
			Количество = стКоличествоЗадач.ИзменениеСтатусаГЧ;	
			Метка = НЕ мУстановленыеМетки.Найти("ИзменениеСтатусаГЧ") = Неопределено;
			ДобавитьЭлементВТипыЗадач("ИзменениеСтатусаГЧ", 	?(Количество = 0, "Изменение статуса ГЧ", "Изменение статуса ГЧ (" + Количество + ")"), Метка);
			
		КонецЕсли;
		
	ИначеЕсли Интерфейсы = Справочники.Интерфейсы.Дизайнер Тогда
		
		Если стКоличествоЗадач = Неопределено Тогда
			
			ДобавитьЭлементВТипыЗадач("СоздатьКартуПроектаДиз", 	"Создать карту проекта диз", 	Истина);
			ДобавитьЭлементВТипыЗадач("ДополнитьКартуПроектаДиз", 	"Дополнить карту проекта диз",	Истина);
			
		Иначе	
			
			Количество = стКоличествоЗадач.СоздатьКартуПроектаДиз;
			Метка = НЕ мУстановленыеМетки.Найти("СоздатьКартуПроектаДиз") = Неопределено;
			ДобавитьЭлементВТипыЗадач("СоздатьКартуПроектаДиз", 	?(Количество = 0, "Создать карту проекта диз", "Создать карту проекта диз (" + Количество + ")"), Метка);
			
			Количество = стКоличествоЗадач.ДополнитьКартуПроектаДиз;	
			Метка = НЕ мУстановленыеМетки.Найти("ДополнитьКартуПроектаДиз") = Неопределено;
			ДобавитьЭлементВТипыЗадач("ДополнитьКартуПроектаДиз", 	?(Количество = 0, "Дополнить карту проекта диз", "Дополнить карту проекта диз (" + Количество + ")"), Метка);
			
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры 

Процедура ДобавитьЭлементВТипыЗадач(Значение, Представление, Метка)
	
	ТипыЗадач.Добавить(Значение, Представление, Метка);
	
КонецПроцедуры

Процедура ЗаполнитьГрафикВыездов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выезды.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыДляВыезда.Документы КАК Документ,
	|	ДокументыДляВыезда.ДатаСоздания КАК ДатаСоздания,
	|	ДокументыДляВыезда.ДатаВыезда КАК ДатаВыезда,
	|	ДокументыДляВыезда.Документы.Проект КАК Проект,
	|	ДокументыДляВыезда.Документы.СокращенноеНазвание КАК СокращенноеНазвание
	|ИЗ
	|	РегистрСведений.ДокументыДляВыезда КАК ДокументыДляВыезда
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыДляВыезда.Документы,
	|	ДокументыДляВыезда.ДатаСоздания,
	|	ДокументыДляВыезда.ДатаВыезда,
	|	ДокументыДляВыезда.Документы.Проект,
	|	ДокументыДляВыезда.Документы.СокращенноеНазвание
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыезда";
	
	Выезды.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура МоиЗадачи(Команда)
	
	ИсполнительЗамеры = омСотрудники.ПолучитьТекущегоПользователя();
	ОбновитьПредставление(ТекущийИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.тзЗадачи.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Проект) Тогда
	
		Элементы.НеВыполненные.ТолькоПросмотр = Ложь;	
	
	Иначе
	
		Элементы.НеВыполненные.ТолькоПросмотр 	= Истина;
		НеВыполненныеЗамеры						= Истина;
	
	КонецЕсли;

	ОбновитьПредставление(ТекущийИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	ОбновитьПредставление(ТекущийИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура НеВыполненныеПриИзменении(Элемент)
	ОбновитьПредставление(ТекущийИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьПредставление(ТекущийИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеЗадачиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПросроченныеЗадачиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.ПросроченныеЗадачи.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПриИзменении(Элемент)
	ОбновитьПредставление(ТекущийИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ВыездыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыездыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыездыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.Выезды.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ИзменениеЗамеров" ИЛИ ИмяСобытия = "ИзменениеПКД") И НЕ мЗамерыИнтерфейс.Найти(ТекущийИнтерфейс) = Неопределено Тогда
	
		ОбновитьПредставление(ТекущийИнтерфейс);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыЗадачПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипыЗадачПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипыЗадачПриИзменении(Элемент)
	ОбновитьПредставление(ТекущийИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура тзЗадачиОсобыеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзЗадачиОсобыеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзЗадачиОсобыеПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.тзЗадачиОсобые.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКанбанТЗ(Команда)
	стПараметры = Новый Структура("Сотрудник, Проект", ИсполнительЗамеры, Проект);
	ОткрытьФорму("Обработка.КанбанТЗ.Форма", стПараметры);
КонецПроцедуры

&НаКлиенте
Процедура тзЗадачиДизайнераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзЗадачиДизайнераПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзЗадачиДизайнераПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.тзЗадачиДизайнера.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
КонецПроцедуры

&НаКлиенте
Процедура Задачи_РКД1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГантКонструктора(Команда)
	стПараметры = Новый Структура("Сотрудник, Проект", ИсполнительЗамеры, Проект);
	ОткрытьФорму("Обработка.ГантКонструкторов.Форма", стПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботеВедущийКонструкторПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботеВедущийКонструкторПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботеВедущийКонструкторПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	ТД = Элементы.ЗадачиВРаботеВедущийКонструктор.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
КонецПроцедуры

&НаКлиенте
Процедура Задачи_ПКД_РКДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Задачи_ПКД_РКДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Задачи_ПКД_РКДПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

	ТД = элементы.Задачи_ПКД_РКД.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	ПоказатьЗначение(, ТД.Задача);
КонецПроцедуры
